### Q1 Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

# Creating a Pandas Series
data = [4, 8, 15, 16, 23, 42]
my_series = pd.Series(data)

# Print the Series
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2 Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [2]:
import pandas as pd

# Create a list with 10 elements
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# Convert the list to a Pandas Series
my_series = pd.Series(my_list)

# Print the Series
print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3 Create a Pandas DataFrame that contains the following data:

In [3]:
import pandas as pd

# Data
data = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

# Create DataFrame
df = pd.DataFrame(data)

# Print the DataFrame
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4 What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional, tabular data structure that is widely used for data manipulation and analysis. It consists of rows and columns, where each column can have a different data type. Essentially, a DataFrame is like a spreadsheet or SQL table. You can think of it as a container for multiple Pandas Series that share the same index.

On the other hand, a Pandas Series is a one-dimensional labeled array, similar to a column in a DataFrame. It can be created from a list, array, or dictionary, and it has an associated index. A DataFrame is essentially a collection of Series, where each column is a Series.

* A Pandas Series is a one-dimensional array with an index, and it represents a single column of data.
* A Pandas DataFrame is a two-dimensional tabular data structure, which can be thought of as a collection of Series. Each column in a DataFrame is a Series.

In [4]:
# Creating a Series
series_data = pd.Series([10, 20, 30, 40], name='Numbers')
print("Series:")
print("\nType of series_data:", type(series_data))
series_data

Series:

Type of series_data: <class 'pandas.core.series.Series'>

0    10
1    20
2    30
3    40
Name: Numbers, dtype: int64

In [5]:
# Creating a DataFrame
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female', 'Male', 'Female']}
df = pd.DataFrame(data)
print("\nDataFrame:")
print("\nType of df:", type(df))
df

DataFrame:

Type of df: <class 'pandas.core.frame.DataFrame'>

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q5 What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas provides a wide range of functions to manipulate and analyze data in a DataFrame. Here are some common functions and methods:

In [6]:
df.head(2)  # Display the first 3 rows

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [7]:
df.tail(2)  # Display the first 3 rows

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [8]:
#Display a concise summary of the DataFrame, including data types and missing values.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [9]:
#describe(): Generate descriptive statistics of the DataFrame's numerical columns.
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [10]:
#shape: Get the dimensions of the DataFrame (number of rows, number of columns).
df.shape

(3, 3)

In [11]:
#columns: Get the column names of the DataFrame.
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [12]:
#sort_values(): Sort the DataFrame by one or more columns.
df.sort_values(by='Age', ascending=False)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
0   Alice   25  Female

In [13]:
#groupby(): Group DataFrame by a column or a combination of columns.
df.groupby('Gender').mean()

         Age
Gender
Female  26.0
Male    30.0

### Q6 Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, the mutable nature refers to whether the data structure can be modified in place. Among Series, DataFrame, and Panel, only DataFrame is mutable.

Series: Immutable. Once a Series is created, you cannot change its size or modify its elements in place. You can, however, create a new Series with modifications.

DataFrame: Mutable. You can modify the contents of a DataFrame, add or remove columns, and perform various operations in place.

Panel: Deprecated. Panels were three-dimensional data structures in Pandas, but they have been deprecated as of version 0.25.0. You should use MultiIndex DataFrames or xarray for three-dimensional data.

### Q7 Create a DataFrame using multiple Series. Explain with an example.

In [14]:
import pandas as pd

# Creating multiple Pandas Series
name_series = pd.Series(['Alice', 'Bob', 'Claire'], name='Name')
age_series = pd.Series([25, 30, 27], name='Age')
gender_series = pd.Series(['Female', 'Male', 'Female'], name='Gender')

# Combining Series into a DataFrame
df = pd.DataFrame({'Name': name_series, 'Age': age_series, 'Gender': gender_series})

# Print the resulting DataFrame
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female